Repository: dorinalamlli/dv-group
Catalog: languages/*.po
Languages: sq

source: Successfully registered to db.
sq: U regjistrua me sukses.

source: The user with provided data exist in our db.
sq: Ky përdorues ekziston tashmë.

source: Email address or name missing/invalid.
sq: Email ose emri mungon / i pavlefshëm.

source: An error has occurred.
sq: Ndodhi një gabim

source: Name
sq: Emri

source: Surname
sq: Mbiemri

source: Email Address
sq: Adresa e emailit

source: Ip Address
sq: Adresa IP

source: User Agent
sq: Agjenti

source: Date
sq: Data

source: Remove
sq: Hiqe

source: Export as CSV
sq: Eksporto CSV

source: User id
sq: ID e Përdoruesit

source: IP Address
sq: Adresa IP

source: Created at
sq: Krijuar më

source: Download file <a href="%s">here</a>
sq: Shkarko dokumentin <a href="%s">këtu</a>

source: Primary
sq: Menuja kryesore

source: Sidebar
sq: Anësore

source: Mobile Menu
sq: Menu mobile

source: Kerko
sq: Kërko

source: Close
sq: Mbyll

source: Cart
sq: Shporta

source: Categories
sq: Kategoritë

source: See more
sq: Shiko me shume

source: Testimonial &amp; Subscription
sq: Komente &amp; Abonim

source: Featured
sq: Të veçanta

source: Buy now
sq: Bli tani

source: Special offers
sq: Oferta Speciale

source: Subscribe
sq: Abonohu

source: to our newsletter &amp; promotion
sq: në buletinin dhe promocionet tona

source: %s would like to connect to your store
sq: %s dëshiron të lidhet me dyqanin tuaj

source: This will give "%s" <strong>%s</strong> access which will allow it to:
sq: Kjo do t&#8217;i japë "%s" <strong>%s</strong> akses i cili do t&#8217;i mundësojë të:

source: Logged in as %s
sq: Loguar si %s

source: Logout
sq: Dil

source: Approve
sq: Mirato

source: Deny
sq: Refuzo

source: To connect to %1$s you need to be logged in. Log in to your store below, or %2$scancel and return to %1$s%3$s
sq: Për t&#8217;u lidhur me %1$s duhet të jeni i loguar. Hyni në dyqan, ose %2$s anullo dhe kthehu tek %1$s%3$s

source: Username or email address
sq: Emër përdoruesi ose adresë emaili

source: Password
sq: Fjalëkalimi

source: Login
sq: Hyni

source: Your cart is currently empty.
sq: Shporta juaj është aktualisht bosh.

source: Return To Shop
sq: Kthehu në dyqan

source: Shipping costs will be calculated once you have provided your address.
sq: Kostoja e transportit do të llogaritet kur ju të vendosni adresën tuaj.

source: There are no shipping methods available. Please double check your address, or contact us if you need any help.
sq: Nuk ka metoda transporti të disponueshme. Ju lutem kontrolloni dhe një herë adresën tuaj ose na kontaktoni nëse keni nevojë për ndihmë.

source: Cart Totals
sq: Totali i shportës

source: Subtotal
sq: Nëntotali

source: Shipping
sq: Dërgesa

source: estimated for %s
sq: Llogaritur për %s

source: Total
sq: Totali

source: Product
sq: Produkt

source: Price
sq: Çmimi

source: Quantity
sq: Sasia

source: Remove this item
sq: Hiqe këtë artikull

source: Coupon:
sq: Kuponi:

source: Coupon code
sq: Kodi i kuponit

source: Apply Coupon
sq: Përdor kuponin

source: Update Cart
sq: Përditëso shportën

source: You may be interested in&hellip;
sq: Mund të jeni i interesuar për&hellip;

source: No products in the cart.
sq: Asnjë produkt në shportë

source: View Cart
sq: Shih shportën

source: Checkout
sq: Pagesa

source: Proceed to Checkout
sq: Përfundo porosinë

source: Calculate Shipping
sq: Llogarit transportin

source: Select a country&hellip;
sq: Zgjidh një vend&hellip;

source: State / county
sq: Vendi/Shteti

source: Select a state&hellip;
sq: Zgjidh një qytet&hellip;

source: City
sq: Qyteti

source: Postcode / ZIP
sq: Kodi postar/Zip

source: Update Totals
sq: Përditëso Totalin

source: There are some issues with the items in your cart (shown above). Please go back to the cart page and resolve these issues before checking out.
sq: Ka disa probleme me artikujt në shportën tuaj (të treguar mësipër). Ju lutem kthehuni tek faqja e shportës dhe zgjidhni këto probleme para se të përfundoni blerjen.

source: Return To Cart
sq: Kthehu tek Shporta

source: Billing &amp; Shipping
sq: Faturimi &amp; Transporti

source: Billing Details
sq: Të dhënat e faturimit

source: Create an account?
sq: Krijo një llogari?

source: Create an account by entering the information below. If you are a returning customer please login at the top of the page.
sq: Krijoni një llogari duke dhënë informacionet mëposhtë. Nëse keni një llogari kryeni login në fillim të faqes.

source: You must be logged in to checkout.
sq: Duhet të jeni i loguar për të bërë checkout.

source: Your order
sq: Porosia juaj

source: Have a coupon?
sq: Keni kupon?

source: Click here to enter your code
sq: Klikoni këtu për të dhënë kodin tuaj

source: Returning customer?
sq: Keni një llogari?

source: Click here to login
sq: Klikoni këtu për të hyrë

source: If you have shopped with us before, please enter your details in the boxes below. If you are a new customer, please proceed to the Billing &amp; Shipping section.
sq: Nëse keni blerë tek ne mëparë, ju lutem jepni të dhënat tuaja në fushat mëposhtë. Nëse jeni një klient i ri ju lutem vazhdoni tek seksioni i Faturimit &amp; Transportit

source: Qty
sq: Sasia

source: Totals
sq: Totali

source: Sorry, it seems that there are no available payment methods for your location. Please contact us if you require assistance or wish to make alternate arrangements.
sq: Na vjen keq, duket se nuk ka metoda të disponueshme pagese për vendndodhjen tuaj. Ju lutem na kontakoni nëse kërkoni asistencë ose dëshironi të kryeni rregullime të tjera.

source: Ship to a different address?
sq: Dërgo në një adresë tjetër?

source: Additional Information
sq: Informacion shtesë

source: Sorry, it seems that there are no available payment methods for your state. Please contact us if you require assistance or wish to make alternate arrangements.
sq: Na vjen keq, duket se nuk ka metoda të disponueshme pagese për shtetin tuaj. Ju lutem na kontakoni nëse kërkoni asistencë ose dëshironi të kryeni rregullime të tjera.

source: Please fill in your details above to see available payment methods.
sq: Ju lutem plotësoni të dhënat tuaja mësipër për të parë metodat e disponueshme të transportit.

source: Update totals
sq: Përditëso Totalin

source: I&rsquo;ve read and accept the <a href="%s" target="_blank">terms &amp; conditions</a>
sq: Lexova dhe pranoj <a href="%s" target="_blank">termat &amp; kushtet</a>

source: Unfortunately your order cannot be processed as the originating bank/merchant has declined your transaction. Please attempt your purchase again.
sq: Fatkeqesisht porosia juaj nuk mund te permbushet pasi banka me te cilen ju operoni ka refuzuar pagesen tuaj. Ju lutemi riprovoni perseri.

source: Pay
sq: Paguaj

source: My Account
sq: Llogaria ime

source: Thank you. Your order has been received.
sq: Faleminderit. Porosia juaj u mor.

source: Order Number:
sq: Numri i porosisë:

source: Date:
sq: Datë:

source: Total:
sq: Totali:

source: Payment Method:
sq: Mënyra e pagesës:

source: The order #%d from %s has been cancelled. The order was as follows:
sq: Porosia #%d nga %s është anulluar. Porosia ishte si mëposhtë:

source: Payment for order #%d from %s has failed. The order was as follows:
sq: Pagesa per porosine #%d nga %s deshtoi. Porosia eshte si ne vazhdim:

source: You have received an order from %s. The order is as follows:
sq: Keni marrë një porosi nga %s. Porosia është si mëposhtë:

source: Hi there. Your recent order on %s has been completed. Your order details are shown below for your reference:
sq: Përshëndetje. Porosia juaj e fundit tek %s është miratuar. Detajet e porosisë tuaj janë treguar mëposhtë për referencë:

source: An order has been created for you on %s. To pay for this order please use the following link: %s
sq: Është krijuar një porosi për ju në %s. Për të paguar për këtë porosi ju lutem përdorni linkun në vijim: %s

source: pay
sq: paguaj

source: Thanks for creating an account on %s. Your username is <strong>%s</strong>
sq: Faleminderit për krijimin e një llogarie në %s. Emri juaj i përdoruesit është <strong>%s</strong>.

source: Your password has been automatically generated: <strong>%s</strong>
sq: Fjakëkalimi juaj është gjeneruar automatikisht: <strong>%s</strong>

source: You can access your account area to view your orders and change your password here: %s.
sq: Mund të hyni këtu:%s në zonën e llogarisë tuaj për të parë porositë dhe për të ndryshuar fjalëkalimin.

source: Hello, a note has just been added to your order:
sq: Përshëndetje, një shënim i është shtuar porosisë tuaj:

source: For your reference, your order details are shown below.
sq: Për referencë, detajet e porosisë tuaj janë shfaqur mëposhtë.

source: Your order is on-hold until we confirm payment has been received. Your order details are shown below for your reference:
sq: Porosia juaj është ne pritje deri ne momentin qe pagesa te merret. Të dhënat e porosisë taj janë paraqitur më poshtë për referencën tuaj:

source: Your order has been received and is now being processed. Your order details are shown below for your reference:
sq: Porosia juaj është marrë dhe po procesohet. Detajet e porosisë tuaj shfaqen mëposhtë për referencë:

source: Hi there. Your order on %s has been partially refunded.
sq: Përshëndetje. Porosia juaj në %s është rimbursuar pjesërisht.

source: Hi there. Your order on %s has been refunded.
sq: Përshëndetje. Porosia juaj në %s është rimbursuar.

source: Someone requested that the password be reset for the following account:
sq: Dikush ka kërkuar rivendosjen e fjalëkalimit për llogarinë e mëposhtme:

source: Username: %s
sq: Emri i përdoruesit: %s

source: If this was a mistake, just ignore this email and nothing will happen.
sq: Nëse ky është një gabim, shpërfilleni këtë email dhe asgjë nuk do të ndodhë.

source: To reset your password, visit the following address:
sq: Për të rivendosur fjalëkalimin tuaj, vizitoni adresën në vijim:

source: Click here to reset your password
sq: Klikoni këtu për të rivendosur fjalëkalimin tuaj

source: Billing address
sq: Adresa e faturimit

source: Shipping address
sq: Adresa e transportit

source: Customer details
sq: Të dhënat e klientit.

source: Order #%s
sq: Porosia #%s

source: You have received an order from %s.
sq: Keni marrë një porosi nga %s.

source: Your password is <strong>%s</strong>.
sq: Fjalëkalimi juaj është <strong>%s</strong>.

source: Hi there. Your order on %s has been refunded. Your order details are shown below for your reference:
sq: Përshëndetje. Porosia juaj tek %s është rimbursuar. Detajet e porosisë tuaj janë shfaqur mëposhtë për referencë:

source: Order number: %s
sq: Numri i porosisë: %s

source: View order: %s
sq: Shih porosinë: %s

source: Quantity: %s
sq: Sasia: %s

source: Cost: %s
sq: Kosto: %s

source: Download %d
sq: Sharko %d

source: Download
sq: Shkarko

source: Username or email
sq: Emri i përdoruesit ose adresa e emailit

source: Remember me
sq: Më mbaj mend

source: Lost your password?
sq: Keni humbur fjalëkalimin?

source: No products were found matching your selection.
sq: Asnjë produkt nuk përkon me përzgjedhjen tuaj.

source: Showing the single result
sq: Rezultati i vetëm

source: Never
sq: Asnjehere

source: Go Shop
sq: Shko tek Dyqani

source: No downloads available yet.
sq: Nuk u gjend asnjë material për shkarkim.

source: Add Payment Method
sq: Shto Metodë Pagese

source: Sorry, it seems that there are no payment methods which support adding a new payment method. Please contact us if you require assistance or wish to make alternate arrangements.
sq: Na vjen keq, duket se nuk ka metoda pagese që suportojnë shtimin e një metode të re pagese. Ju lutem na kontakoni nëse kërkoni asistencë ose dëshironi të kryeni rregullime të tjera.

source: First name
sq: Emri

source: Last name
sq: Mbiemri

source: Email address
sq: Adresa e emailit

source: Password Change
sq: Ndryshim Fjalëkalimi

source: Current Password (leave blank to leave unchanged)
sq: Fjalëkalimi Aktual (bosh për ta lënë të pandryshuar)

source: New Password (leave blank to leave unchanged)
sq: Fjalëkalimi i ri (bosh për ta lënë të pandryshuar)

source: Confirm New Password
sq: Konfirmo Fjalëkalimin e Ri

source: Save changes
sq: Ruaj ndryshimet

source: Billing Address
sq: Adresa e faturimit

source: Shipping Address
sq: Adresa e transportit

source: Save Address
sq: Ruaj Adresën

source: Register
sq: Regjistrohu

source: Username
sq: Emri i përdoruesit

source: Lost your password? Please enter your username or email address. You will receive a link to create a new password via email.
sq: Keni harruar fjalëkalimin? Ju lutem jepni emrin e përdoruesit ose adresën e emailit. Do të merrni një link me email për të krijuar një fjalëkalim të ri.

source: Reset Password
sq: Rivendos fjalëkalimin

source: Enter a new password below.
sq: Jepni një fjalëkalim të ri mëposhtë.

source: New password
sq: Fjalëkalim i ri

source: Re-enter new password
sq: Rijepni fjalëkalimin e ri.

source: Save
sq: Ruaj

source: Password reset email has been sent.
sq: Emaili për rivendosjen e fjalëkalimit u dërgua.

source: A password reset email has been sent to the email address on file for your account, but may take several minutes to show up in your inbox. Please wait at least 10 minutes before attempting another reset.
sq: Ju kemi dërguar një email me të dhënat e nevojshme për të rivendosur fjalëkalimin, ( ky email mund te vonojë disa minuta ).

source: The following addresses will be used on the checkout page by default.
sq: Adresat në vijim do të përdoren si default në faqen e përfundimit të porosisë.

source: Edit
sq: Ndrysho

source: You have not set up this type of address yet.
sq: Nuk e keni vendosur ende këtë tip adrese.

source: Available Downloads
sq: Shkarkime të disponueshme

source: %s download remaining
sq: %s download mbetur

source: Order
sq: Porosi

source: Status
sq: Statusi

source: Recent Orders
sq: Porositë e fundit

source: %s for %s item
sq: %s për%s artikull

source: View
sq: Shih

source: Cancel
sq: Anullo

source: Previous
sq: Prapa

source: Next
sq: Përpara

source: No order has been made yet.
sq: Nuk është bërë ende asnjë pororsi.

source: %s ending in %s
sq: %s mbaron me %s

source: No saved methods found.
sq: Nuk u gjet asnjë metodë!

source: Order #%1$s was placed on %2$s and is currently %3$s.
sq: Porosia #%1$s u vendos më %2$s dhe është në statusin %3$s.

source: Order Updates
sq: Përditësimet e Porosisë

source: To track your order please enter your Order ID in the box below and press the "Track" button. This was given to you on your receipt and in the confirmation email you should have received.
sq: Për të gjurmuar porosinë tuaj ju lutem jepni ID e Porosisë në fushën mëposhtë dhe shtypni butonin "Gjurmo". Ky ju është dhënë në faturën tuaj dhe në emailin e konfirmimit që duhet të keni marrë.

source: Order ID
sq: ID e Porosisë

source: Found in your order confirmation email.
sq: Gjendet në emailin e konfirmimit të porosisë tuaj.

source: Billing Email
sq: Emaili i Faturimit

source: Email you used during checkout.
sq: Emaili që keni përdorur gjatë procesit të checkout.

source: Track
sq: Gjurmo

source: Order Again
sq: Porosit Përsëri

source: Customer Details
sq: Detajet e Klientit

source: Note:
sq: Shënim

source: Telephone:
sq: Telefon:

source: N/A
sq: Jo e dhënë

source: Order Details
sq: Detajet e Porosisë

source: Search for:
sq: Kërko për:

source: Search Products&hellip;
sq: Kërko Produktet&hellip;

source: Search
sq: Kërko

source: %s review for %s%s%s
sq: %s koment për %s%s%s

source: Reviews
sq: Komente

source: There are no reviews yet.
sq: Nuk ka ende komente!

source: Add a review
sq: Shtoni një koment

source: Be the first to review &ldquo;%s&rdquo;
sq: Lini një koment për &ldquo;%s&rdquo;

source: Leave a Reply to %s
sq: Lini një Përgjigje %s

source: Submit
sq: Dërgo

source: You must be <a href="%s">logged in</a> to post a review.
sq: Duhet të jeni <a href="%s">i loguar</a> për të shkruar një koment

source: Your Rating
sq: Vlerësimi juaj

source: Rate&hellip;
sq: Vlerëso&hellip;

source: Perfect
sq: E përkryer

source: Good
sq: Mirë

source: Average
sq: Mesatare

source: Not that bad
sq: Jo keq

source: Very Poor
sq: Shumë e dobët

source: Your Review
sq: Komenti juaj

source: Only logged in customers who have purchased this product may leave a review.
sq: Vetëm klientët e loguar që kanë blerë këtë produkt mund të lënë një koment.

source: This product is currently out of stock and unavailable.
sq: Produkti ka mbaruar dhe nuk është i disponueshëm.

source: Clear
sq: Rifillo

source: Sorry, this product is unavailable. Please choose a different combination.
sq: Na vjen keq, ky produkt nuk është i disponueshëm. Ju lutem zgjidhni një kombinim tjetër.

source: Category:
sq: Kategoria:

source: Tag:
sq: Etiketë produkti

source: Weight
sq: Pesha

source: Dimensions
sq: Përmasat

source: Rated %s out of 5
sq: Vlerësuar %s nga 5

source: out of %s5%s
sq: nga %s5%s

source: based on %s customer rating
sq: në bazë të%s vlerësimit të konsumatorëve

source: %s customer review
sq: %s koment

source: Related Products
sq: Produkte të ngjashme

source: Your comment is awaiting approval
sq: Komenti juaj po pret miratim

source: out of 5
sq: nga 5

source: Product Description
sq: Përshkrimi i Produktit

source: You may also like&hellip;
sq: Mund t&#8217;iu pëlqejë edhe&hellip;
